---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleMatrix44
source: html/e483b386-4b38-e05d-206a-1aa7e070001b.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDoubleMatrix44

Represents a property consisting of an array of double values.

## Syntax (C#)
```csharp
public class AssetPropertyDoubleMatrix44 : AssetProperty
```

## Remarks
In virtually all cases, the array will contain exactly 16 values.
 It represents a 4x4 matrix.